HaiQNguyen/Oryx_608_Porting/SAME54_Oryx_ATECC608/main.c
	printf("Authentication in progress\n\r");
	
	status = atcab_init( &cfg_ateccx08a_i2c_device );
	CHECK_STATUS(status);
	
	status = tng_get_type(&t);
	CHECK_STATUS(status);
	
	switch (t){
		case TNGTYPE_22:
		printf("type: 22\r\n");
		break;
		case TNGTYPE_TN:
		printf("type: TN\r\n");
		break;
		case TNGTYPE_UNKNOWN:
		printf("unknown\r\n");
		break;
	}
	
	printf("Device init complete\n\r");
	
	status = atcab_read_serial_number((uint8_t*)&serial_number);
	CHECK_STATUS(status);
	
	printf("Serial Number of host\r\n");
	print_bytes((uint8_t*)&serial_number, 9);
	printf("\r\n");
	
	//Configure I/Os
	ioInit();

	//Initialize hardware cryptography accelerator
	same54CryptoInit();


	//Enable TRNG peripheral clock
	MCLK->APBCMASK.reg |= MCLK_APBCMASK_TRNG;
	//Enable TRNG
	TRNG->CTRLA.reg |= TRNG_CTRLA_ENABLE;

	//Generate a random seed
	for(i = 0; i < 32; i += 4)
	{
		//Wait for the TRNG to contain a valid data
		while(!(TRNG->INTFLAG.reg & TRNG_INTFLAG_DATARDY));

		//Get 32-bit random value
		value = TRNG->DATA.reg;

		//Copy random value
		seed[i] = value & 0xFF;
		seed[i + 1] = (value >> 8) & 0xFF;
		seed[i + 2] = (value >> 16) & 0xFF;
		seed[i + 3] = (value >> 24) & 0xFF;
	}

	//PRNG initialization
	error = yarrowInit(&yarrowContext);
	//Any error to report?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to initialize PRNG!\r\n");
	}

	//Properly seed the PRNG
	error = yarrowSeed(&yarrowContext, seed, sizeof(seed));
	//Any error to report?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to seed PRNG!\r\n");
	}

	//TCP/IP stack initialization
	error = netInit();
	//Any error to report?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to initialize TCP/IP stack!\r\n");
	}
	//Configure the first Ethernet interface
	interface = &netInterface[0];

	//Set interface name
	netSetInterfaceName(interface, APP_IF_NAME);
	//Set host name
	netSetHostname(interface, APP_HOST_NAME);
	//Set host MAC address
	macStringToAddr(APP_MAC_ADDR, &macAddr);
	netSetMacAddr(interface, &macAddr);
	//Select the relevant network adapter
	netSetDriver(interface, &same54EthDriver);
	netSetPhyDriver(interface, &ksz8091PhyDriver);

	//Initialize network interface
	error = netConfigInterface(interface);
	//Any error to report?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to configure interface %s!\r\n", interface->name);
	}

#if (IPV4_SUPPORT == ENABLED)
#if (APP_USE_DHCP_CLIENT == ENABLED)
	//Get default settings
	dhcpClientGetDefaultSettings(&dhcpClientSettings);
	//Set the network interface to be configured by DHCP
	dhcpClientSettings.interface = interface;
	//Disable rapid commit option
	dhcpClientSettings.rapidCommit = FALSE;

	//DHCP client initialization
	error = dhcpClientInit(&dhcpClientContext, &dhcpClientSettings);
	//Failed to initialize DHCP client?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to initialize DHCP client!\r\n");
	}

	//Start DHCP client
	error = dhcpClientStart(&dhcpClientContext);
	//Failed to start DHCP client?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to start DHCP client!\r\n");
	}
#else
	//Set IPv4 host address
	ipv4StringToAddr(APP_IPV4_HOST_ADDR, &ipv4Addr);
	ipv4SetHostAddr(interface, ipv4Addr);

	//Set subnet mask
	ipv4StringToAddr(APP_IPV4_SUBNET_MASK, &ipv4Addr);
	ipv4SetSubnetMask(interface, ipv4Addr);

	//Set default gateway
	ipv4StringToAddr(APP_IPV4_DEFAULT_GATEWAY, &ipv4Addr);
	ipv4SetDefaultGateway(interface, ipv4Addr);

	//Set primary and secondary DNS servers
	ipv4StringToAddr(APP_IPV4_PRIMARY_DNS, &ipv4Addr);
	ipv4SetDnsServer(interface, 0, ipv4Addr);
	ipv4StringToAddr(APP_IPV4_SECONDARY_DNS, &ipv4Addr);
	ipv4SetDnsServer(interface, 1, ipv4Addr);
#endif
#endif

//#if (MDNS_CLIENT_SUPPORT == ENABLED)
//#if (MDNS_RESPONDER_SUPPORT ENABLED == ENABLED)

	//Get default settings
	mdnsResponderGetDefaultSettings(&mdnsResponderSettings);
	//Underlying network interface
	mdnsResponderSettings.interface = &netInterface[0];

	//mDNS responder initialization
	error = mdnsResponderInit(&mdnsResponderContext, &mdnsResponderSettings);
	//Failed to initialize mDNS responder?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to initialize mDNS responder!\r\n");
	}

	//Set mDNS hostname
	error = mdnsResponderSetHostname(&mdnsResponderContext, "ArrowHostName");
	//Any error to report?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to set hostname!\r\n");
	}

	//Start mDNS responder
	error = mdnsResponderStart(&mdnsResponderContext);
	//Failed to start mDNS responder?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to start mDNS responder!\r\n");
	}
//#endif
//#endif

#if (IPV6_SUPPORT == ENABLED)
#if (APP_USE_SLAAC == ENABLED)
	//Get default settings
	slaacGetDefaultSettings(&slaacSettings);
	//Set the network interface to be configured
	slaacSettings.interface = interface;

	//SLAAC initialization
	error = slaacInit(&slaacContext, &slaacSettings);
	//Failed to initialize SLAAC?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to initialize SLAAC!\r\n");
	}

	//Start IPv6 address autoconfiguration process
	error = slaacStart(&slaacContext);
	//Failed to start SLAAC process?
	if(error)
	{
		//Debug message
		TRACE_ERROR("Failed to start SLAAC!\r\n");
	}
	#else
	//Set link-local address
	ipv6StringToAddr(APP_IPV6_LINK_LOCAL_ADDR, &ipv6Addr);
	ipv6SetLinkLocalAddr(interface, &ipv6Addr);

	//Set IPv6 prefix
	ipv6StringToAddr(APP_IPV6_PREFIX, &ipv6Addr);
	ipv6SetPrefix(interface, 0, &ipv6Addr, APP_IPV6_PREFIX_LENGTH);

	//Set global address
	ipv6StringToAddr(APP_IPV6_GLOBAL_ADDR, &ipv6Addr);
	ipv6SetGlobalAddr(interface, 0, &ipv6Addr);

	//Set default router
	ipv6StringToAddr(APP_IPV6_ROUTER, &ipv6Addr);
	ipv6SetDefaultRouter(interface, 0, &ipv6Addr);

	//Set primary and secondary DNS servers
	ipv6StringToAddr(APP_IPV6_PRIMARY_DNS, &ipv6Addr);
	ipv6SetDnsServer(interface, 0, &ipv6Addr);
	ipv6StringToAddr(APP_IPV6_SECONDARY_DNS, &ipv6Addr);
	ipv6SetDnsServer(interface, 1, &ipv6Addr);
#endif
#endif


	//Create MQTT test task
	task = osCreateTask("MQTT", mqttTestTask, NULL, 750, OS_TASK_PRIORITY_NORMAL);
	//Failed to create the task?
	if(task == OS_INVALID_HANDLE)
	{
		//Debug message
		TRACE_ERROR("Failed to create task!\r\n");
	}

