HaiQNguyen/Oryx_608_Porting/SAME54_Oryx_ATECC608/main.c
	//Create a task to blink the LED
	task = osCreateTask("LED", ledTask, NULL, 200, OS_TASK_PRIORITY_NORMAL);
	//Failed to create the task?
	if(task == OS_INVALID_HANDLE)
	{
		//Debug message
		TRACE_ERROR("Failed to create task!\r\n");
	}

	//Start the execution of tasks
	TRACE_INFO("before OSKernelStart\r\n");
	osStartKernel();
	TRACE_INFO("after OSKernelStart\r\n");
	while(1){
	error = 0;
	}
	//This function should never return
	return 0;
}

void print_bytes(uint8_t * ptr, uint8_t length)
{
	
	uint8_t i = 0;
	uint8_t line_count = 0;
	for(;i < length; i++) {
		printf("0x%02x, ",ptr[i]);
		line_count++;
		if(line_count == 8) {
			printf("\r\n");
			line_count = 0;
		}
	}
	
	printf("\r\n");
}


error_t ecc508aEcdhCallback(TlsContext *context)
{
   error_t error;
   uint8_t qa[ATCA_PUB_KEY_SIZE];
   uint8_t qb[ATCA_PUB_KEY_SIZE];
   uint8_t s[ATCA_KEY_SIZE];
   ATCA_STATUS status;

   //Debug message
   TRACE_INFO("ECC608A ECDH callback\r\n");

   //NIST-P256 elliptic curve?
   if(context->ecdhContext.params.type == EC_CURVE_TYPE_SECP_R1 &&
      mpiGetBitLength(&context->ecdhContext.params.p) == 256)
   {
      //Convert the x-coordinate of the peer's public key to an octet string
      error = mpiWriteRaw(&context->ecdhContext.qb.x, qb, 32);

      //Check status code
      if(!error)
      {
         //Convert the y-coordinate of the peer's public key to an octet string
         error = mpiWriteRaw(&context->ecdhContext.qb.y, qb + 32, 32);
      }

      //Check status code
      if(!error)
      {
         //Debug message
         TRACE_DEBUG_ARRAY("  qb: ", qb, ATCA_PUB_KEY_SIZE);

         //Perform ECDH key exchange
         status = atcatls_ecdhe(TLS_SLOT_ECDHE_PRIV, qb, qa, s);

         //Debug message
         TRACE_INFO("atcatls_ecdhe = %u\r\n", status);
         TRACE_DEBUG_ARRAY("  qa: ", qa, ATCA_PUB_KEY_SIZE);
         TRACE_DEBUG_ARRAY("  s: ", s, ATCA_KEY_SIZE);

         //Successful operation?
         if(status == ATCA_SUCCESS)
         {
            //Save the shared secret
            memcpy(context->premasterSecret, s, 32);
            context->premasterSecretLen = 32;

            //Convert the x-coordinate of our public key to an octet string
            error = mpiReadRaw(&context->ecdhContext.qa.x, qa, 32);
            
            //Check status code
            if(!error)
            {
               //Convert the y-coordinate of our public key to an octet string
               error = mpiReadRaw(&context->ecdhContext.qa.y, qa + 32, 32);
            }
         }
         else
         {
            //Failed to perform ECDH key exchange
            error = ERROR_FAILURE;
         }
      }
   }
   else
   {
      //The specified elliptic curve is not supported
      error = ERROR_UNSUPPORTED_ELLIPTIC_CURVE;
   }

   //Return status code
   return error;
}


/**
 * @brief ECDSA signature generation callback function
 **/

error_t ecc508aEcdsaSignCallback(TlsContext *context,
   const uint8_t *digest, size_t digestLength, EcdsaSignature *signature)
{
   error_t error;
   ATCA_STATUS status;
   uint8_t sig[ATCA_SIG_SIZE];

   //Debug message
   TRACE_INFO("ECC608A ECDSA signature generation callback\r\n");
   TRACE_DEBUG("  digest:\r\n");
   TRACE_DEBUG_ARRAY("    ", digest, digestLength);

   //SHA-256 hash algorithm?
   if(context->signHashAlgo == TLS_HASH_ALGO_SHA256 &&
      digestLength == SHA256_DIGEST_SIZE)
   {
      //Generate an ECDSA signature using the client's private key
      status = atcatls_sign(TLS_SLOT_AUTH_PRIV, digest, sig);

      //Debug message
      TRACE_INFO("atcatls_sign = %u\r\n", status);
      TRACE_INFO_ARRAY("  ", sig, ATCA_SIG_SIZE);

      //Successful operation?
      if(status == ATCA_SUCCESS)
      {
         //Convert R to a multiple precision integer
         error = mpiReadRaw(&signature->r, sig, ATCA_SIG_SIZE / 2);

         //Check status code
         if(!error)
         {
            //Convert S to a multiple precision integer
            error = mpiReadRaw(&signature->s,
               sig + ATCA_SIG_SIZE / 2, ATCA_SIG_SIZE / 2);
         }

         //Check status code
         if(!error)
         {
            //Debug message
            TRACE_DEBUG_MPI("r:  ", &signature->r);
            TRACE_DEBUG_MPI("s:  ", &signature->s);
         }
      }
      else
      {
         //Failed to generate ECDSA signature
         error = ERROR_FAILURE;
      }
   }
   else
   {
      //The specified hash algorithm is not supported
      error = ERROR_UNSUPPORTED_HASH_ALGO;
   }

   //Return status code
   return error;
}


/**
 * @brief ECDSA signature verification callback function
 **/

error_t ecc508aEcdsaVerifyCallback(TlsContext *context,
   const uint8_t *digest, size_t digestLength, EcdsaSignature *signature)
{
   error_t error;
   ATCA_STATUS status;
   uint8_t sig[ATCA_SIG_SIZE];
   uint8_t pubKey[ATCA_PUB_KEY_SIZE];
   bool verified;

   //Debug message
   TRACE_INFO("ECC608A ECDSA signature verification callback\r\n");
   TRACE_DEBUG("  digest:\r\n");
   TRACE_DEBUG_ARRAY("    ", digest, digestLength);
   
   //NIST-P256 elliptic curve?
   if(context->peerEcParams.type == EC_CURVE_TYPE_SECP_R1 &&
      mpiGetBitLength(&context->peerEcParams.p) == 256)
   {
      if(digestLength == SHA256_DIGEST_SIZE)
      {
         //Convert R to an octet string
         error = mpiWriteRaw(&signature->r, sig, ATCA_SIG_SIZE / 2);

         //Check status code
         if(!error)
         {
            //Convert S to an octet string
            error = mpiWriteRaw(&signature->s,
               sig + ATCA_SIG_SIZE / 2, ATCA_SIG_SIZE / 2);
         }
         
         //Check status code
         if(!error)
         {
            //Convert the x-coordinate of the public key to an octet string
            error = mpiWriteRaw(&context->peerEcPublicKey.x, pubKey,
               ATCA_PUB_KEY_SIZE / 2);
         }

         //Check status code
         if(!error)
         {
            //Convert the y-coordinate of the public key to an octet string
            error = mpiWriteRaw(&context->peerEcPublicKey.y,
               pubKey + ATCA_PUB_KEY_SIZE / 2, ATCA_PUB_KEY_SIZE / 2);
         }
         
         //Check status code
         if(!error)
         {
            //Verify the ECDSA signature
            status = atcatls_verify(digest, sig, pubKey, &verified);  

            //Debug message
            TRACE_INFO("atcatls_verify = %u,%u\r\n", status, verified);
            TRACE_INFO_ARRAY("  ", sig, ATCA_SIG_SIZE);

            //Failed to verify ECDSA signature?
            if(status != ATCA_SUCCESS || !verified)
            {
               //Report an error
               error = ERROR_FAILURE;
            }
         }
      }
      else
      {
         //The specified hash algorithm is not supported
         error = ERROR_UNSUPPORTED_HASH_ALGO;
      }
   }
   else
   {
      //The specified elliptic curve is not supported
      error = ERROR_UNSUPPORTED_ELLIPTIC_CURVE;
   }

   //Return status code
   return error;
}